meeting/minutes/2022/10-18.org
:PROPERTIES:
:ID:       664784A2-6875-4E41-826D-26DE03EC0F5B
:END:
#+title: QT4 CG Meeting 007 Minutes 2022-10-18
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

Approved [[./10-25.html][at meeting 008]] on 25 October 2022.

* Summary of new and continuing actions [0/6]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)
+ [ ] QT4CG-008-01: MK to implement the resolution of issue #165 (“:=” and no “$”)
+ [ ] QT4CG-008-02: NW to fix or replace #199, it doesn’t reflect the original correctly
+ [ ] QT4CG-008-03: NW to make the GitHub PR link to the diffs
+ [ ] QT4CG-008-04: RD to review pull request #202
+ [ ] QT4CG-008-05: NW to make an issue for Martin’s proposed ammendment to map:build

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [9/13]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: BTW, EP

+ [X] Anthony Bufort (AB)
+ [X] Reece Dunn (RD)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK)
+ [X] Michael Kay (MK)
+ [X] John Lumley (JL)
+ [X] Dimitre Novatchev (DN)
+ [ ] Ed Porter (EP) 
+ [ ] Liam Quin (LQ)
+ [ ] Adam Retter
+ [X] C. M. Sperberg-McQueen (MSM)
+ [ ] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW). /Chair/. /Scribe/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2022/10-18.html][the agenda]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting [[../../agenda/2022/10-25.html][is scheduled for Tuesday, 25 October]]. Any regrets?

None heard.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2022/10-11.html][the minutes of the previous meeting]].

Accepted.

** Review of open action items [5/6]
:PROPERTIES:
:CUSTOM_ID: review-of-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
  + Continued
+ [X] QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)
+ [X] QT4CG-006-01: JK to review the variadic functions proposal in #197
+ [X] QT4CG-006-02: NW to make the changed files heading to be more obviously a link.
  + Changes commited to the =gh-pages= branch on 11 October 2022
+ [X] QT4CG-006-03: MK to make a separate proposal for supporting the Unicode operator symbols
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html
  + https://github.com/qt4cg/qtspecs/issues/204
+ [X] QT4CG-006-04: NW to point to the dashboard links from the agendas.
  + See this agenda, for example :-)

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

