meeting/minutes/2022/10-18.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 007 Minutes 2022-10-18</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 007 Minutes 2022-10-18</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/6]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[9/13]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#next-meeting">1.3. Next meeting</a></li>
<li><a href="#approve-minutes">1.4. Approve minutes of the previous meeting</a></li>
<li><a href="#review-of-actions">1.5. Review of open action items <code>[5/6]</code></a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#pr-variadic-functions">2.1. Review pull request #197 (was 166; variadic functions)</a></li>
<li><a href="#issue-165">2.2. Issue #165, keyword arguments, “:=” or “:”</a></li>
<li><a href="#pr-items-before">2.3. Review pull request #199 (was 177; items before, etc.)</a></li>
<li><a href="#pr-xsl-match">2.4. Review pull request #200 (was 185; drop xsl:match instruction)</a></li>
<li><a href="#pr-subtyping">2.5. Review pull request #202 (was 196; subtyping)</a></li>
<li><a href="#pr-map-build">2.6. Review pull request #203: Issue 151: map:build</a></li>
<li><a href="#pr-math-atan2">2.7. Review pull request #206: Corrections to math:atan2</a></li>
<li><a href="#issue-170">2.8. Issue #170, XPath “otherwise” operator</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/6]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-01: MK to implement the resolution of issue #165 (“:=” and no “$”)</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-02: NW to fix or replace #199, it doesn’t reflect the original correctly</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-03: NW to make the GitHub PR link to the diffs</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-04: RD to review pull request #202</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-05: NW to make an issue for Martin’s proposed ammendment to map:build</li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[9/13]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW, EP
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Anthony Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="off"><code>[&#xa0;]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="off"><code>[&#xa0;]</code> Adam Retter</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Chair</i>. <i>Scribe</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2022/10-18.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2022/10-25.html">is scheduled for Tuesday, 25 October</a>. Any regrets?
</p>

<p>
None heard.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/10-11.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-review-of-actions" class="outline-3">
<h3 id="review-of-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[5/6]</code></h3>
<div class="outline-text-3" id="text-review-of-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
<ul class="org-ul">
<li>Continued</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)</li>
<li class="on"><code>[X]</code> QT4CG-006-01: JK to review the variadic functions proposal in #197</li>
<li class="on"><code>[X]</code> QT4CG-006-02: NW to make the changed files heading to be more obviously a link.
<ul class="org-ul">
<li>Changes commited to the <code>gh-pages</code> branch on 11 October 2022</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-006-03: MK to make a separate proposal for supporting the Unicode operator symbols
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html</a></li>
<li><a href="https://github.com/qt4cg/qtspecs/issues/204">https://github.com/qt4cg/qtspecs/issues/204</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-006-04: NW to point to the dashboard links from the agendas.
<ul class="org-ul">
<li>See this agenda, for example :-)</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
