meeting/minutes/2022/10-18.org
** Review pull request #197 (was 166; variadic functions)
:PROPERTIES:
:CUSTOM_ID: pr-variadic-functions
:END:

+ See [[https://qt4cg.org/#pr-197][pull request #197]] (you’ll find links to formatted versions of the specs at [[https://qt4cg.org/]]).
+ See also the nexus of issues [[https://github.com/qt4cg/qtspecs/issues/162][#162]], [[https://github.com/qt4cg/qtspecs/issues/161][#161]], [[https://github.com/qt4cg/qtspecs/issues/160][#160]], [[https://github.com/qt4cg/qtspecs/issues/159][#159]], [[https://github.com/qt4cg/qtspecs/issues/158][#158]], [[https://github.com/qt4cg/qtspecs/issues/157][#157]], and [[https://github.com/qt4cg/qtspecs/issues/155][#155]].
+ See the discussion from [[../../minutes/2022/10-11.html#pr-variadic-functions][last week]].

Mike summarizes the reviews so far.

+ MK: There are difficulties with the presentation, many of which
  derive from the 3.1 spec. I haven’t seen any comments related to the
  technical questions.
+ RD: JK asked about “=” or “:=”.
+ MK: Yes, we have a separate issue for that.
+ MSM: I would like to pose a question, but it will lead to bike shedding.
+ NW: You have 5 minutes.
+ MSM: When I was reading it, I became less and less comfortable with
  the term “declared function” because we have to explain several
  times that it isn’t a function, it’s a function family.
+ MK: Yes, I’m proposing to change that to “function definition.”
+ MSM: I thought “function family” might be a possibility.
+ MK: I tried that. I think it sounds too much like a set of
  functions, which it isn’t really because there’s also additional
  metadtaa, so I decided not to use that.
+ MSM: If we allow implementations to search multiple namespaces and
  resolve conflicts, is it somehow inconsistent?
+ MK: It’s unfortuante that tht issue has raised its head here. The
  reason is that in my first draft, I proposed changes to function
  resolution, partly to make more legitimate what XSLT was doing
  with overrides and packages. Some of the chagnes aren’t a
  substantive part of the proposal, they’re designed to tidy up text
  that should never have been there.
+ MSM: But if we allow host langeauges to supply conflict
  resolution rules for some kinds of conflicts, forbidding it from
  resolving arity conflicts seems odd.
+ MK: Yes, there’s a bit of a tension there because XSLT has always
  has its own rules. Those have never been reflected in XPath which is
  why I tried to generalize the text.

We’ll come back to this again next week.

** Issue #165, keyword arguments, “:=” or “:”
:PROPERTIES:
:CUSTOM_ID: issue-165
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/165][this issue]] may be ready to be decided.

+ MK: The initial issue was what symbol do we use and then it was
  widened to the question of whether we should put a =$= in front of the
  keyword.
+ RD: Doesn’t that conflict with scripting extensions?
+ MK: We already have conflicts there, so that doesn’t help me.
+ DN: I would prefer not to use =$= because it is more typing and I
  have ides for using ~$~ or ~$$~ for something else in the future.
+ RD: If we use ~$~ in the function call, doesn’t that mean that we
  then have a parsing ambiguity that breaks the current convention of
  having a two symbol look-ahead to resolve conflicts? Having an
  =NCName= followed by a colon would be a keyword parameter whereas
  =$NCname= could be a parameter being passed to a function call or it
  could be defining a name parameter.
+ MK: I think there are already places where we need two character look-ahead.
+ RD: But what about more than two?

Some discussion about whether “$” “NCName” “:” is two or three symbol
look-ahead.

+ CG: I would vote against ~$~, because I think variable references
  and declarations would look pretty similar. In NW’s example, there’s
  a =let= keyword in front. One of my proposals was to use a simple
  string followed by a colon.
+ NW: Is that a third propsal, “:” instead of “:=” or “=”
+ CG: Yes.
+ MK: I think putting it in quotes has too much of an implication that
  you can define the name variably instead of literally.
+ RD: If we extend this to support map keys, if we don’t allow
  strings, don’t we have the restriction that we can’t reference keys
  with spaces? So we’d need to support stings. If we only support
  strings, we don’t allow QNames. Whereas parameters can be QNames. We
  need to support EQNames and if we extend it to map keys, strings.
+ MK: I think there are two questions, ~:=~ or ~:~ and the use of ~$~.
  I think the impression I got is that the discussion favored ~:=~
  because it’s similar to other places where we bind values to
  parameter names, like declaring the default in an XQuery function
  declaration and it reduces some for ambiguity when you have a QName
  there.

Proposal: use “:=”

Accepted.

+ NW: Do we want to resolve the ~$~ question now?
+ MK: It would be nice to resolve it, I think we know everything we
  need to know. It’s technically redundant, we’re only doing it
  because we use them everywhere else. It draws it out visually. I’m
  marginally in favor of including it, but it’s not something I feel
  immensely strongly about.
+ MSM: I agree
+ RD: I’d be against it because it would be a conflict with the
  scripting extension syntax.
+ DN: From what I hear, I have a feeling the majority is opposed to
  the ~$~. I’d like to add one more thing, it’s because ~$name~ can
  very easily be construed as a reference to a variable and we could
  even have ~$x := $x~.
+ AB: I’ll register my agreement with RD not to do it.

Proposal: No “$”

Accepted.

ACTION QT4CG-008-01: MK to implement the resolution of issue #165 (“:=” and no “$”)

** Review pull request #199 (was 177; items before, etc.)
:PROPERTIES:
:CUSTOM_ID: pr-items-before
:END:

+ See [[https://qt4cg.org/#pr-199][pull request #199]]

+ MSM: My comment on it came just before the meeting.

In the course of attempting to review the item, we discovered that the PR is malformed.

ACTION QT4CG-008-02: NW to fix or replace #199, it doesn’t reflect the original correctly

** Review pull request #200 (was 185; drop xsl:match instruction)
:PROPERTIES:
:CUSTOM_ID: pr-xsl-match
:END:

+ See [[https://qt4cg.org/#pr-200][pull request #200]]

+ MK: I proposed it a while ago. The intent was to find a way to use
  pattern smore flexibly, but I haven’t really found a proposal that
  I’m comfortable with. I’m not happy, so I prefer to drop it.

Proposal: Accept PR #200, drop xsl:match

Accepted.

