meeting/minutes/2022/10-18.html

<div id="outline-container-pr-variadic-functions" class="outline-3">
<h3 id="pr-variadic-functions"><span class="section-number-3">2.1.</span> Review pull request #197 (was 166; variadic functions)</h3>
<div class="outline-text-3" id="text-pr-variadic-functions">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-197">pull request #197</a> (you’ll find links to formatted versions of the specs at <a href="https://qt4cg.org/">https://qt4cg.org/</a>).</li>
<li>See also the nexus of issues <a href="https://github.com/qt4cg/qtspecs/issues/162">#162</a>, <a href="https://github.com/qt4cg/qtspecs/issues/161">#161</a>, <a href="https://github.com/qt4cg/qtspecs/issues/160">#160</a>, <a href="https://github.com/qt4cg/qtspecs/issues/159">#159</a>, <a href="https://github.com/qt4cg/qtspecs/issues/158">#158</a>, <a href="https://github.com/qt4cg/qtspecs/issues/157">#157</a>, and <a href="https://github.com/qt4cg/qtspecs/issues/155">#155</a>.</li>
<li>See the discussion from <a href="../../minutes/2022/10-11.html#pr-variadic-functions">last week</a>.</li>
</ul>

<p>
Mike summarizes the reviews so far.
</p>

<ul class="org-ul">
<li>MK: There are difficulties with the presentation, many of which
derive from the 3.1 spec. I haven’t seen any comments related to the
technical questions.</li>
<li>RD: JK asked about “=” or “:=”.</li>
<li>MK: Yes, we have a separate issue for that.</li>
<li>MSM: I would like to pose a question, but it will lead to bike shedding.</li>
<li>NW: You have 5 minutes.</li>
<li>MSM: When I was reading it, I became less and less comfortable with
the term “declared function” because we have to explain several
times that it isn’t a function, it’s a function family.</li>
<li>MK: Yes, I’m proposing to change that to “function definition.”</li>
<li>MSM: I thought “function family” might be a possibility.</li>
<li>MK: I tried that. I think it sounds too much like a set of
functions, which it isn’t really because there’s also additional
metadtaa, so I decided not to use that.</li>
<li>MSM: If we allow implementations to search multiple namespaces and
resolve conflicts, is it somehow inconsistent?</li>
<li>MK: It’s unfortuante that tht issue has raised its head here. The
reason is that in my first draft, I proposed changes to function
resolution, partly to make more legitimate what XSLT was doing
with overrides and packages. Some of the chagnes aren’t a
substantive part of the proposal, they’re designed to tidy up text
that should never have been there.</li>
<li>MSM: But if we allow host langeauges to supply conflict
resolution rules for some kinds of conflicts, forbidding it from
resolving arity conflicts seems odd.</li>
<li>MK: Yes, there’s a bit of a tension there because XSLT has always
has its own rules. Those have never been reflected in XPath which is
why I tried to generalize the text.</li>
</ul>

<p>
We’ll come back to this again next week.
</p>
</div>
</div>

<div id="outline-container-issue-165" class="outline-3">
<h3 id="issue-165"><span class="section-number-3">2.2.</span> Issue #165, keyword arguments, “:=” or “:”</h3>
<div class="outline-text-3" id="text-issue-165">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/165">this issue</a> may be ready to be decided.
</p>

<ul class="org-ul">
<li>MK: The initial issue was what symbol do we use and then it was
widened to the question of whether we should put a <code>$</code> in front of the
keyword.</li>
<li>RD: Doesn’t that conflict with scripting extensions?</li>
<li>MK: We already have conflicts there, so that doesn’t help me.</li>
<li>DN: I would prefer not to use <code>$</code> because it is more typing and I
have ides for using <code>$</code> or <code>$$</code> for something else in the future.</li>
<li>RD: If we use <code>$</code> in the function call, doesn’t that mean that we
then have a parsing ambiguity that breaks the current convention of
having a two symbol look-ahead to resolve conflicts? Having an
<code>NCName</code> followed by a colon would be a keyword parameter whereas
<code>$NCname</code> could be a parameter being passed to a function call or it
could be defining a name parameter.</li>
<li>MK: I think there are already places where we need two character look-ahead.</li>
<li>RD: But what about more than two?</li>
</ul>

<p>
Some discussion about whether “$” “NCName” “:” is two or three symbol
look-ahead.
</p>

<ul class="org-ul">
<li>CG: I would vote against <code>$</code>, because I think variable references
and declarations would look pretty similar. In NW’s example, there’s
a <code>let</code> keyword in front. One of my proposals was to use a simple
string followed by a colon.</li>
<li>NW: Is that a third propsal, “:” instead of “:=” or “=”</li>
<li>CG: Yes.</li>
<li>MK: I think putting it in quotes has too much of an implication that
you can define the name variably instead of literally.</li>
<li>RD: If we extend this to support map keys, if we don’t allow
strings, don’t we have the restriction that we can’t reference keys
with spaces? So we’d need to support stings. If we only support
strings, we don’t allow QNames. Whereas parameters can be QNames. We
need to support EQNames and if we extend it to map keys, strings.</li>
<li>MK: I think there are two questions, <code>:=</code> or <code>:</code> and the use of <code>$</code>.
I think the impression I got is that the discussion favored <code>:=</code>
because it’s similar to other places where we bind values to
parameter names, like declaring the default in an XQuery function
declaration and it reduces some for ambiguity when you have a QName
there.</li>
</ul>

<p>
Proposal: use “:=”
</p>

<p>
Accepted.
</p>

<ul class="org-ul">
<li>NW: Do we want to resolve the <code>$</code> question now?</li>
<li>MK: It would be nice to resolve it, I think we know everything we
need to know. It’s technically redundant, we’re only doing it
because we use them everywhere else. It draws it out visually. I’m
marginally in favor of including it, but it’s not something I feel
immensely strongly about.</li>
<li>MSM: I agree</li>
<li>RD: I’d be against it because it would be a conflict with the
scripting extension syntax.</li>
<li>DN: From what I hear, I have a feeling the majority is opposed to
the <code>$</code>. I’d like to add one more thing, it’s because <code>$name</code> can
very easily be construed as a reference to a variable and we could
even have <code>$x := $x</code>.</li>
<li>AB: I’ll register my agreement with RD not to do it.</li>
</ul>

<p>
Proposal: No “$”
</p>

<p>
Accepted.
</p>

<p>
ACTION QT4CG-008-01: MK to implement the resolution of issue #165 (“:=” and no “$”)
</p>
</div>
</div>

<div id="outline-container-pr-items-before" class="outline-3">
<h3 id="pr-items-before"><span class="section-number-3">2.3.</span> Review pull request #199 (was 177; items before, etc.)</h3>
<div class="outline-text-3" id="text-pr-items-before">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-199">pull request #199</a></li>

<li>MSM: My comment on it came just before the meeting.</li>
</ul>

<p>
In the course of attempting to review the item, we discovered that the PR is malformed.
</p>

<p>
ACTION QT4CG-008-02: NW to fix or replace #199, it doesn’t reflect the original correctly
</p>
</div>
</div>

<div id="outline-container-pr-xsl-match" class="outline-3">
<h3 id="pr-xsl-match"><span class="section-number-3">2.4.</span> Review pull request #200 (was 185; drop xsl:match instruction)</h3>
<div class="outline-text-3" id="text-pr-xsl-match">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-200">pull request #200</a></li>

<li>MK: I proposed it a while ago. The intent was to find a way to use
pattern smore flexibly, but I haven’t really found a proposal that
I’m comfortable with. I’m not happy, so I prefer to drop it.</li>
</ul>

<p>
Proposal: Accept PR #200, drop xsl:match
</p>

<p>
Accepted.
</p>
</div>
</div>
