meeting/minutes/2022/10-18.org
** Review pull request #202 (was 196; subtyping)
:PROPERTIES:
:CUSTOM_ID: pr-subtyping
:END:

+ See [[https://qt4cg.org/#pr-202][pull request #202]]

+ MK: This is essentially an editorial proosal, though it does fill a
  few gaps in the subtyping rules. It’s designed to use a more generous
  layout for the rules and a more readable notation. It’s easy to find
  the rules you want and the more generous layout offers more room
  for examples.
+ JL: I have a question on procedure. I’m trying to find out where the
  information is.

Some discsion of the difficulty in finding the item. The organization
of the qt4cg.org pages, and the relationship to the GitHub pull
request is not as clear as it could be.

ACTION: QT4CG-008-03: NW to make the GitHub PR link to the diffs

+ RD: I’d like to review the proposal.

ACTION: QT4CG-008-04: RD to review pull request #202

** Review pull request #203: Issue 151: map:build
:PROPERTIES:
:CUSTOM_ID: pr-map-build
:END:

+ See [[https://qt4cg.org/#pr-203][pull request #203]]

MK walks us through the proposal.

+ MK: Martin Honnen also raised discussed this [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0035.html][in email]].
+ MK: This was previously described as =map:group-by()= that was less powerful.
  + They way you do this today is with =map:merge()= which is unintuitive and clumsy.
  + The modification that Marin has proposed is that you should be able
    to compute more than one key for each item in the input sequence,
    all of which will be bound to the same value
  + That conflicts with the way thtat DN might like to extend it, by
    allowing keys to contain multiple atomic values. That would, say,
    generate one composite key rather than multiple single keys.
  + I’m fairly neutral to Martin’s extension; I’d be happy to accept
    it but I don’t care strongly.
+ MSM: DN, can you clarify something? I can see the utilty of having
  the same item reachable thorugh mutliple keys. I can’t describe a use
  case off the top of my head, but Martin’s proposal feels intuitive to me.
  When I have a compound key, or something that would in other contexts
  be called a compound key, I tend to use nested maps. I haven’t felt
  any more unhappy with that than I am with maps generally. I’m
  wondering, what do we get from allowing a sequence serve as a
  key?
+ DN: There is a separate issue in which this is discussed quite
  throughly (scribe believes it is [[https://github.com/qt4cg/qtspecs/issues/119][#119]]). There, I also have an example with nested maps and
  as an alternative. But it feels like it is quite challenging, even for
  two nested maps. It would practically be impossible for even deeper
  maps
+ MSM: Ok, I’ll look at that issue.

NW asks if we could resolve this issue independently of Martin’s
suggestion. Agreement is we could.

ACTION QT4CG-008-05: NW to make an issue for Martin’s proposed ammendment to map:build

+ DN: Because we just provide the input, I undestand that we can
  construct the key and the map is a function from the key to the value.
  But the way I first read it, was that the value is a function of the
  input, not the key. Maybe the prose could be clarified?
+ MK: I’ll see if I can construct an example that demonstrates that.
+ JL: This gives me a mapping that’s normally an identity and we can
  do a replacement in parts of that.
+ MSM: I’ve struggled a bit with =map:merge=, partly because of
  an implementation detail, but my recolleciton is that in map merge,
  there’s a kewyord for what to do with duplicates and here it’s a function.
+ MK: The five options we provide on =map:merge= can all be implemented
  by very simple funtions. And there are lots of other options that
  you might want, that you could also do with functions. Providing a
  general function instead of a selection of four would be a useful
  enhancement.
+ MSM: Thank you.

Proposal: Accept pull request #203.

Accepted.

** Review pull request #206: Corrections to math:atan2
:PROPERTIES:
:CUSTOM_ID: pr-math-atan2
:END:

+ See [[https://qt4cg.org/#pr-206][pull request #206]]

+ RD: I noticed when looking at the way =math:atan2= was specified was
  that it didn’t match the output that it should. So I in my issue I
  outlined the issues and MK has fixed them.

Some discussion of the IEEE spec.

Proposal: Accept pull request #206.

Accepted

** Issue #170, XPath “otherwise” operator
:PROPERTIES:
:CUSTOM_ID: issue-170
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/170][this issue]] may be ready to be decided.

There’s no PR for this issue because the text is already in the draft.

+ MSM: If I’m understanding this correctly, in cases where the left
  hand argument returns at most one item, this has the same effect as
  =($a,$b)[1]=. This generalizes that to allowing either operator to return
  multiple items.
+ MK: Yes. It has two benefits. One is, the existing notation =($a,$b)[1]= is
  highly obsecure. And the other is that it enables you to let the
  left hand operand be a multi-item sequence.
+ DN: I think everything is clear, but from my practice as a
  developer. I think there could be a confusion. What’s proposed is
  that if the left hand side (LHS) is the empty sequence, we choose
  the right hand side (RHS). Some peple may think this is applicable if the LHS is the
  empty string or =false()=, can we do something about this?
+ JK: In that spirit, I’d like to propose a synonym, =fallback= which
  may avoid the confusion.
+ RD: I’d be wary of extending it to things like =false()= or the empty
  string. It could led to confusing behavior like in JavaScript.
+ MSM: To put it on the table, we could do two things to address the
  concern: one is to revise the proposal in the direction of saying if
  the effective boolean value (EBV) of the LHS is false then take the RHS. The alternative is
  use a different keyword to avoid the mental association with
  booleans.
+ RD: If you have something like ~$x := false() return $x otherwise 2~,
  then you would expect it to return ~$x~ but if we allow EBV, then it
  would return ~false()~. What this is solving is  the case where you have the empty sequence!
+ DN: From C#, there is a function =is-null-or-empty= and another other is
  =is-null-or-whitespace=. There’s an operator that does null as well.
+ JL: I’d favor keeping the current propsoal because what you’re
  tryign to do is make it clear what the current practice of using =($a,$b)[1]= is for!

Time is up. We’ll have to come back to this next week.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.

