meeting/minutes/2022/10-18.html

<div id="outline-container-pr-subtyping" class="outline-3">
<h3 id="pr-subtyping"><span class="section-number-3">2.5.</span> Review pull request #202 (was 196; subtyping)</h3>
<div class="outline-text-3" id="text-pr-subtyping">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-202">pull request #202</a></li>

<li>MK: This is essentially an editorial proosal, though it does fill a
few gaps in the subtyping rules. It’s designed to use a more generous
layout for the rules and a more readable notation. It’s easy to find
the rules you want and the more generous layout offers more room
for examples.</li>
<li>JL: I have a question on procedure. I’m trying to find out where the
information is.</li>
</ul>

<p>
Some discsion of the difficulty in finding the item. The organization
of the qt4cg.org pages, and the relationship to the GitHub pull
request is not as clear as it could be.
</p>

<p>
ACTION: QT4CG-008-03: NW to make the GitHub PR link to the diffs
</p>

<ul class="org-ul">
<li>RD: I’d like to review the proposal.</li>
</ul>

<p>
ACTION: QT4CG-008-04: RD to review pull request #202
</p>
</div>
</div>

<div id="outline-container-pr-map-build" class="outline-3">
<h3 id="pr-map-build"><span class="section-number-3">2.6.</span> Review pull request #203: Issue 151: map:build</h3>
<div class="outline-text-3" id="text-pr-map-build">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-203">pull request #203</a></li>
</ul>

<p>
MK walks us through the proposal.
</p>

<ul class="org-ul">
<li>MK: Martin Honnen also raised discussed this <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0035.html">in email</a>.</li>
<li>MK: This was previously described as <code>map:group-by()</code> that was less powerful.
<ul class="org-ul">
<li>They way you do this today is with <code>map:merge()</code> which is unintuitive and clumsy.</li>
<li>The modification that Marin has proposed is that you should be able
to compute more than one key for each item in the input sequence,
all of which will be bound to the same value</li>
<li>That conflicts with the way thtat DN might like to extend it, by
allowing keys to contain multiple atomic values. That would, say,
generate one composite key rather than multiple single keys.</li>
<li>I’m fairly neutral to Martin’s extension; I’d be happy to accept
it but I don’t care strongly.</li>
</ul></li>
<li>MSM: DN, can you clarify something? I can see the utilty of having
the same item reachable thorugh mutliple keys. I can’t describe a use
case off the top of my head, but Martin’s proposal feels intuitive to me.
When I have a compound key, or something that would in other contexts
be called a compound key, I tend to use nested maps. I haven’t felt
any more unhappy with that than I am with maps generally. I’m
wondering, what do we get from allowing a sequence serve as a
key?</li>
<li>DN: There is a separate issue in which this is discussed quite
throughly (scribe believes it is <a href="https://github.com/qt4cg/qtspecs/issues/119">#119</a>). There, I also have an example with nested maps and
as an alternative. But it feels like it is quite challenging, even for
two nested maps. It would practically be impossible for even deeper
maps</li>
<li>MSM: Ok, I’ll look at that issue.</li>
</ul>

<p>
NW asks if we could resolve this issue independently of Martin’s
suggestion. Agreement is we could.
</p>

<p>
ACTION QT4CG-008-05: NW to make an issue for Martin’s proposed ammendment to map:build
</p>

<ul class="org-ul">
<li>DN: Because we just provide the input, I undestand that we can
construct the key and the map is a function from the key to the value.
But the way I first read it, was that the value is a function of the
input, not the key. Maybe the prose could be clarified?</li>
<li>MK: I’ll see if I can construct an example that demonstrates that.</li>
<li>JL: This gives me a mapping that’s normally an identity and we can
do a replacement in parts of that.</li>
<li>MSM: I’ve struggled a bit with <code>map:merge</code>, partly because of
an implementation detail, but my recolleciton is that in map merge,
there’s a kewyord for what to do with duplicates and here it’s a function.</li>
<li>MK: The five options we provide on <code>map:merge</code> can all be implemented
by very simple funtions. And there are lots of other options that
you might want, that you could also do with functions. Providing a
general function instead of a selection of four would be a useful
enhancement.</li>
<li>MSM: Thank you.</li>
</ul>

<p>
Proposal: Accept pull request #203.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-math-atan2" class="outline-3">
<h3 id="pr-math-atan2"><span class="section-number-3">2.7.</span> Review pull request #206: Corrections to math:atan2</h3>
<div class="outline-text-3" id="text-pr-math-atan2">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-206">pull request #206</a></li>

<li>RD: I noticed when looking at the way <code>math:atan2</code> was specified was
that it didn’t match the output that it should. So I in my issue I
outlined the issues and MK has fixed them.</li>
</ul>

<p>
Some discussion of the IEEE spec.
</p>

<p>
Proposal: Accept pull request #206.
</p>

<p>
Accepted
</p>
</div>
</div>

<div id="outline-container-issue-170" class="outline-3">
<h3 id="issue-170"><span class="section-number-3">2.8.</span> Issue #170, XPath “otherwise” operator</h3>
<div class="outline-text-3" id="text-issue-170">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/170">this issue</a> may be ready to be decided.
</p>

<p>
There’s no PR for this issue because the text is already in the draft.
</p>

<ul class="org-ul">
<li>MSM: If I’m understanding this correctly, in cases where the left
hand argument returns at most one item, this has the same effect as
<code>($a,$b)[1]</code>. This generalizes that to allowing either operator to return
multiple items.</li>
<li>MK: Yes. It has two benefits. One is, the existing notation <code>($a,$b)[1]</code> is
highly obsecure. And the other is that it enables you to let the
left hand operand be a multi-item sequence.</li>
<li>DN: I think everything is clear, but from my practice as a
developer. I think there could be a confusion. What’s proposed is
that if the left hand side (LHS) is the empty sequence, we choose
the right hand side (RHS). Some peple may think this is applicable if the LHS is the
empty string or <code>false()</code>, can we do something about this?</li>
<li>JK: In that spirit, I’d like to propose a synonym, <code>fallback</code> which
may avoid the confusion.</li>
<li>RD: I’d be wary of extending it to things like <code>false()</code> or the empty
string. It could led to confusing behavior like in JavaScript.</li>
<li>MSM: To put it on the table, we could do two things to address the
concern: one is to revise the proposal in the direction of saying if
the effective boolean value (EBV) of the LHS is false then take the RHS. The alternative is
use a different keyword to avoid the mental association with
booleans.</li>
<li>RD: If you have something like <code>$x := false() return $x otherwise 2</code>,
then you would expect it to return <code>$x</code> but if we allow EBV, then it
would return <code>false()</code>. What this is solving is  the case where you have the empty sequence!</li>
<li>DN: From C#, there is a function <code>is-null-or-empty</code> and another other is
<code>is-null-or-whitespace</code>. There’s an operator that does null as well.</li>
<li>JL: I’d favor keeping the current propsoal because what you’re
tryign to do is make it clear what the current practice of using <code>($a,$b)[1]</code> is for!</li>
</ul>

<p>
Time is up. We’ll have to come back to this next week.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
